Autodesk.Revit.DB.SpatialElementTag.LeaderElbow
The position of the leader's elbow (middle point).
Remarks:
Returns the elbow point of the tag leader.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader for this tag.
-or-
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.LeaderEnd
The position of the leader's end.
Remarks:
Returns the end point of the tag leader.
Leader end point must be located inside of a room, space or an area.
Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The point is located outside of the spatial element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader for this tag.
-or-
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.TagHeadPosition
The position of the tag's head.
Remarks:
Returns the end point of the tag leader.
Leader end point must be located inside of a room, space or an area.
Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Head position of the tag with no leader could not be located outside of the host element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.RotationAngle
The rotation angle of the tag relative to its view
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Angle can only be changed for Model orientation
Since:
2022